Revit 2027 API
BuiltInFailures.CurtainWallFailures.NoPanelsLoaded Property
 No Curtain Panel Families loaded. Can't make arced Curtain Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoPanelsLoaded { get; }
Public Shared ReadOnly Property NoPanelsLoaded As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoPanelsLoaded {
	FailureDefinitionId^ get ();
}
static member NoPanelsLoaded : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace